ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_pie_ctrl_regs.xml
<module id="PIE_CTRL_REGS" HW_revision="" description="PIE CTRL Registers">
	<register id="PIECTRL" width="16" page="1" offset="0x0" internal="0" description="ePIE Control Register">
		<bitfield id="ENPIE" description="PIE Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PIEVECT" description="PIE Vector Address" begin="15" end="1" width="15" rwaccess="R"/>
	</register>
	<register id="PIEACK" width="16" page="1" offset="0x1" internal="0" description="Interrupt Acknowledge Register">
		<bitfield id="ACK1" description="Acknowledge PIE Interrupt Group 1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACK2" description="Acknowledge PIE Interrupt Group 2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ACK3" description="Acknowledge PIE Interrupt Group 3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ACK4" description="Acknowledge PIE Interrupt Group 4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACK5" description="Acknowledge PIE Interrupt Group 5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACK6" description="Acknowledge PIE Interrupt Group 6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ACK7" description="Acknowledge PIE Interrupt Group 7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ACK8" description="Acknowledge PIE Interrupt Group 8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ACK9" description="Acknowledge PIE Interrupt Group 9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ACK10" description="Acknowledge PIE Interrupt Group 10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ACK11" description="Acknowledge PIE Interrupt Group 11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ACK12" description="Acknowledge PIE Interrupt Group 12" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER1" width="16" page="1" offset="0x2" internal="0" description="Interrupt Group 1 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 1.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 1.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 1.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 1.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 1.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 1.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 1.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 1.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 1.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 1.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 1.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 1.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 1.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 1.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 1.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 1.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR1" width="16" page="1" offset="0x3" internal="0" description="Interrupt Group 1 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 1.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 1.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 1.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 1.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 1.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 1.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 1.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 1.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 1.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 1.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 1.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 1.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 1.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 1.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 1.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 1.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER2" width="16" page="1" offset="0x4" internal="0" description="Interrupt Group 2 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 2.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 2.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 2.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 2.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 2.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 2.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 2.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 2.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 2.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 2.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 2.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 2.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 2.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 2.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 2.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 2.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR2" width="16" page="1" offset="0x5" internal="0" description="Interrupt Group 2 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 2.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 2.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 2.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 2.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 2.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 2.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 2.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 2.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 2.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 2.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 2.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 2.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 2.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 2.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 2.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 2.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
