ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_pie_ctrl_regs.xml
	<register id="PIEIER11" width="16" page="1" offset="0x16" internal="0" description="Interrupt Group 11 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 11.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 11.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 11.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 11.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 11.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 11.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 11.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 11.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 11.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 11.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 11.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 11.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 11.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 11.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 11.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 11.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR11" width="16" page="1" offset="0x17" internal="0" description="Interrupt Group 11 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 11.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 11.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 11.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 11.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 11.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 11.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 11.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 11.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 11.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 11.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 11.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 11.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 11.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 11.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 11.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 11.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIER12" width="16" page="1" offset="0x18" internal="0" description="Interrupt Group 12 Enable Register">
		<bitfield id="INTx1" description="Enable for Interrupt 12.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Enable for Interrupt 12.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Enable for Interrupt 12.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Enable for Interrupt 12.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Enable for Interrupt 12.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Enable for Interrupt 12.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Enable for Interrupt 12.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Enable for Interrupt 12.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Enable for Interrupt 12.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Enable for Interrupt 12.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Enable for Interrupt 12.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Enable for Interrupt 12.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Enable for Interrupt 12.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Enable for Interrupt 12.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Enable for Interrupt 12.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Enable for Interrupt 12.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEIFR12" width="16" page="1" offset="0x19" internal="0" description="Interrupt Group 12 Flag Register">
		<bitfield id="INTx1" description="Flag for Interrupt 12.1" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="INTx2" description="Flag for Interrupt 12.2" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="INTx3" description="Flag for Interrupt 12.3" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="INTx4" description="Flag for Interrupt 12.4" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INTx5" description="Flag for Interrupt 12.5" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INTx6" description="Flag for Interrupt 12.6" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INTx7" description="Flag for Interrupt 12.7" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INTx8" description="Flag for Interrupt 12.8" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INTx9" description="Flag for Interrupt 12.9" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="INTx10" description="Flag for Interrupt 12.10" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="INTx11" description="Flag for Interrupt 12.11" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INTx12" description="Flag for Interrupt 12.12" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="INTx13" description="Flag for Interrupt 12.13" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="INTx14" description="Flag for Interrupt 12.14" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="INTx15" description="Flag for Interrupt 12.15" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INTx16" description="Flag for Interrupt 12.16" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
